OpenAtomFoundation/TobudOS/board/Nuvoton_M251/BSP/Inc/psio_reg.h
#define PSIO_TRANSTS_OUTEPY7_Pos         (30)                                              /*!< PSIO_T::TRANSTS: OUTEPY7 Position      */
#define PSIO_TRANSTS_OUTEPY7_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY7_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY7 Mask          */

#define PSIO_TRANSTS_OUTUF7_Pos          (31)                                              /*!< PSIO_T::TRANSTS: OUTUF7 Position       */
#define PSIO_TRANSTS_OUTUF7_Msk          (0x1ul << PSIO_TRANSTS_OUTUF7_Pos)                /*!< PSIO_T::TRANSTS: OUTUF7 Mask           */

#define PSIO_ISSTS_VALID0_Pos            (0)                                                /*!< PSIO_T::ISSTS: VALID0 Position         */
#define PSIO_ISSTS_VALID0_Msk            (0x1ul << PSIO_ISSTS_VALID0_Pos)                   /*!< PSIO_T::ISSTS: VALID0 Mask             */

#define PSIO_ISSTS_INSTSOV0_Pos          (1)                                                /*!< PSIO_T::ISSTS: INSTSOV0 Position       */
#define PSIO_ISSTS_INSTSOV0_Msk          (0x1ul << PSIO_ISSTS_INSTSOV0_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV0 Mask           */

#define PSIO_ISSTS_VALID1_Pos            (2)                                                /*!< PSIO_T::ISSTS: VALID1 Position         */
#define PSIO_ISSTS_VALID1_Msk            (0x1ul << PSIO_ISSTS_VALID1_Pos)                   /*!< PSIO_T::ISSTS: VALID1 Mask             */

#define PSIO_ISSTS_INSTSOV1_Pos          (3)                                                /*!< PSIO_T::ISSTS: INSTSOV1 Position       */
#define PSIO_ISSTS_INSTSOV1_Msk          (0x1ul << PSIO_ISSTS_INSTSOV1_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV1 Mask           */

#define PSIO_ISSTS_VALID2_Pos            (4)                                                /*!< PSIO_T::ISSTS: VALID2 Position         */
#define PSIO_ISSTS_VALID2_Msk            (0x1ul << PSIO_ISSTS_VALID2_Pos)                   /*!< PSIO_T::ISSTS: VALID2 Mask             */

#define PSIO_ISSTS_INSTSOV2_Pos          (5)                                                /*!< PSIO_T::ISSTS: INSTSOV2 Position       */
#define PSIO_ISSTS_INSTSOV2_Msk          (0x1ul << PSIO_ISSTS_INSTSOV2_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV2 Mask           */

#define PSIO_ISSTS_VALID3_Pos            (6)                                                /*!< PSIO_T::ISSTS: VALID3 Position         */
#define PSIO_ISSTS_VALID3_Msk            (0x1ul << PSIO_ISSTS_VALID3_Pos)                   /*!< PSIO_T::ISSTS: VALID3 Mask             */

#define PSIO_ISSTS_INSTSOV3_Pos          (7)                                                /*!< PSIO_T::ISSTS: INSTSOV3 Position       */
#define PSIO_ISSTS_INSTSOV3_Msk          (0x1ul << PSIO_ISSTS_INSTSOV3_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV3 Mask           */

#define PSIO_ISSTS_VALID4_Pos            (8)                                                /*!< PSIO_T::ISSTS: VALID4 Position         */
#define PSIO_ISSTS_VALID4_Msk            (0x1ul << PSIO_ISSTS_VALID4_Pos)                   /*!< PSIO_T::ISSTS: VALID4 Mask             */

#define PSIO_ISSTS_INSTSOV4_Pos          (9)                                                /*!< PSIO_T::ISSTS: INSTSOV4 Position       */
#define PSIO_ISSTS_INSTSOV4_Msk          (0x1ul << PSIO_ISSTS_INSTSOV4_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV4 Mask           */

#define PSIO_ISSTS_VALID5_Pos            (10)                                               /*!< PSIO_T::ISSTS: VALID5 Position         */
#define PSIO_ISSTS_VALID5_Msk            (0x1ul << PSIO_ISSTS_VALID5_Pos)                   /*!< PSIO_T::ISSTS: VALID5 Mask             */

#define PSIO_ISSTS_INSTSOV5_Pos          (11)                                               /*!< PSIO_T::ISSTS: INSTSOV5 Position       */
#define PSIO_ISSTS_INSTSOV5_Msk          (0x1ul << PSIO_ISSTS_INSTSOV5_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV5 Mask           */

#define PSIO_ISSTS_VALID6_Pos            (12)                                               /*!< PSIO_T::ISSTS: VALID6 Position         */
#define PSIO_ISSTS_VALID6_Msk            (0x1ul << PSIO_ISSTS_VALID6_Pos)                   /*!< PSIO_T::ISSTS: VALID6 Mask             */

#define PSIO_ISSTS_INSTSOV6_Pos          (13)                                               /*!< PSIO_T::ISSTS: INSTSOV6 Position       */
#define PSIO_ISSTS_INSTSOV6_Msk          (0x1ul << PSIO_ISSTS_INSTSOV6_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV6 Mask           */

#define PSIO_ISSTS_VALID7_Pos            (14)                                               /*!< PSIO_T::ISSTS: VALID7 Position         */
#define PSIO_ISSTS_VALID7_Msk            (0x1ul << PSIO_ISSTS_VALID7_Pos)                   /*!< PSIO_T::ISSTS: VALID7 Mask             */

#define PSIO_ISSTS_INSTSOV7_Pos          (15)                                               /*!< PSIO_T::ISSTS: INSTSOV7 Position       */
#define PSIO_ISSTS_INSTSOV7_Msk          (0x1ul << PSIO_ISSTS_INSTSOV7_Pos)                 /*!< PSIO_T::ISSTS: INSTSOV7 Mask           */

#define PSIO_PDMACTL_OPIN0EN_Pos         (0)                                               /*!< PSIO_T::PDMACTL: OPIN0EN Position      */
#define PSIO_PDMACTL_OPIN0EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN0EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN0EN Mask          */

#define PSIO_PDMACTL_OPIN1EN_Pos         (1)                                               /*!< PSIO_T::PDMACTL: OPIN1EN Position      */
#define PSIO_PDMACTL_OPIN1EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN1EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN1EN Mask          */

#define PSIO_PDMACTL_OPIN2EN_Pos         (2)                                               /*!< PSIO_T::PDMACTL: OPIN2EN Position      */
#define PSIO_PDMACTL_OPIN2EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN2EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN2EN Mask          */

#define PSIO_PDMACTL_OPIN3EN_Pos         (3)                                               /*!< PSIO_T::PDMACTL: OPIN3EN Position      */
#define PSIO_PDMACTL_OPIN3EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN3EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN3EN Mask          */

#define PSIO_PDMACTL_OPIN4EN_Pos         (4)                                               /*!< PSIO_T::PDMACTL: OPIN4EN Position      */
#define PSIO_PDMACTL_OPIN4EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN4EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN4EN Mask          */

